app/Models/AdminModel.php

    public function getData($params){
        $builder = $this->table($this->table);
        $builder->where('username=', $params);
        $builder->orWhere('email=', $params);

        $query = $builder->get();
---
SELECT *
FROM `admin`
WHERE `username` = 'admin'
OR `email` = 'admin'