app/Models/GaleriModel.php

    function getThreeGaleri(){
        $builder = $this->table($this->table);

        $builder->orderBy('RAND()')->limit(3);
        $query = $builder->get();
---
SELECT *
FROM `galeri`
ORDER BY RAND()
 LIMIT 3