app/Models/PengaduanModel.php

SELECT *
FROM `pengaduan`
---
    public function getData(){
        $builder = $this->table($this->table);
        $pengaduan = $builder->get()->getResultArray();

SELECT *
FROM `pengaduan`
WHERE `id_pengaduan` = '14'
---
    public function getSingleData($id_pengaduan){
        $builder = $this->table($this->table);

        $builder->select('*');
        $builder->where('id_pengaduan', $id_pengaduan);
        $query = $builder->get();