app/Models/PostsModel.php

SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `post_title` = 'a'
---
    public function makeSlug($title){
        $builder = $this->table($this->table);
        $url = strip_tags($title);
        $url = preg_replace('/[^A-Za-z0-9]/', " ", $url);
        $url = trim($url);
        $url = preg_replace('/[^A-Za-z0-9]/', "-", $url);
        $url = strtolower($url);

        $builder->where('post_title', $title);
        $jumlah = $builder->countAllResults();

INSERT INTO `posts` (`post_title`, `post_status`, `post_description`, `post_content`, `post_type`, `post_thumb`, `kategori_id`, `slug`) VALUES ('a', 'active', 'asd', '<p>asdasd</p>\r\n', 'page', '', '7', 'a')
---
    public function insertPost($data){
        $builder = $this->table($this->table);

        // foreach($data as $key=>$value){
        //     $data[$key] = purify_html($value);
        // }

        if (isset($data['id_post'])) {
            $action = $builder->save($data);
            $id = $data['id_post'];
        } else {
            $data['slug'] = $this->makeSlug($data['post_title']);
            $action = $builder->save($data);

SELECT *
FROM `posts`
LEFT JOIN `kategori_post` ON `kategori_post`.`id_kategori` = `posts`.`kategori_id`
WHERE   (
`post_title` LIKE '%%' ESCAPE '!'
OR  `post_description` LIKE '%%' ESCAPE '!'
OR  `post_content` LIKE '%%' ESCAPE '!'
 )
AND kategori_id IS NULL
OR `kategori_post`.`id_kategori` IS NOT NULL
ORDER BY `post_time` DESC
---
    public function ListPosts($keyword=null){
        $builder = $this->table($this->table);

        $arr_keyword = explode(" ", $keyword);

        $builder->groupStart();

        for($x=0;$x<count($arr_keyword);$x++){
            $builder->orLike('post_title', $arr_keyword[$x]);
            $builder->orLike('post_description', $arr_keyword[$x]);
            $builder->orLike('post_content', $arr_keyword[$x]);
        }

        $builder->groupEnd();

        $builder->select('*');
        $builder->join('kategori_post', 'kategori_post.id_kategori = posts.kategori_id', 'left');
        $builder->where('kategori_id IS NULL', null, false); // Menambahkan kondisi untuk mengambil data dengan kategori_id NULL
        $builder->orWhere('kategori_post.id_kategori IS NOT NULL');
        $builder->orderBy('post_time', 'desc');

        $data['record'] = $builder->get();

SELECT *
FROM `posts`
LEFT JOIN `kategori_post` ON `kategori_post`.`id_kategori` = `posts`.`kategori_id`
WHERE   (
`post_title` LIKE '%%' ESCAPE '!'
OR  `post_description` LIKE '%%' ESCAPE '!'
OR  `post_content` LIKE '%%' ESCAPE '!'
 )
AND kategori_id IS NULL
OR `kategori_post`.`id_kategori` IS NOT NULL
OR `post_type` = 'page'
ORDER BY `post_time` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `posts`
LEFT JOIN `kategori_post` ON `kategori_post`.`id_kategori` = `posts`.`kategori_id`
WHERE   (
`post_title` LIKE '%%' ESCAPE '!'
OR  `post_description` LIKE '%%' ESCAPE '!'
OR  `post_content` LIKE '%%' ESCAPE '!'
 )
AND kategori_id IS NULL
OR `kategori_post`.`id_kategori` IS NOT NULL
OR `post_type` = 'page'
---
    function beritaBuatUser($post_type, $jumlah_baris, $keyword, $group_dataset = null) {
        $builder = $this->table($this->table);

        $arr_keyword = explode(" ", $keyword);
        $builder->groupStart();
        for ($i=0; $i < count($arr_keyword) ; $i++) {
            $builder->like('post_title', $arr_keyword[$i]);
            $builder->orLike('post_description', $arr_keyword[$i]);
            $builder->orLike('post_content', $arr_keyword[$i]);
        }
        $builder->groupEnd();

        $builder->join('kategori_post', 'kategori_post.id_kategori = posts.kategori_id', 'left');
        $builder->where('kategori_id IS NULL', null, false); // Menambahkan kondisi untuk mengambil data dengan kategori_id NULL
        $builder->orWhere('kategori_post.id_kategori IS NOT NULL');
        $builder->orWhere('post_type', $post_type);
        $builder->orderBy('post_time', 'desc');

        $data['record'] = $builder->paginate($jumlah_baris, $group_dataset);